Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/edc/PIC32CK2051SG00064S1.PIC
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="TX_STATUS" edc:nzwidth="0x20" edc:access="--------r-rrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xBFFFFF" edc:_addr="0x50000040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="TXREMAINING" edc:nzwidth="0x10" edc:desc="Transmit Bytes Remaining"/>
            <edc:SFRFieldDef edc:cname="TXTYPE" edc:nzwidth="0x4" edc:desc="Message Type"/>
            <edc:SFRFieldDef edc:cname="TXINT" edc:nzwidth="0x1" edc:desc="Transmit Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXFULL" edc:nzwidth="0x1" edc:desc="Transmit FIFO Full"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERROR" edc:nzwidth="0x1" edc:desc="Transmit Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="RX_STATUS" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x50000044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="RXREMAINING" edc:nzwidth="0x10" edc:desc="Receive Bytes Remaining"/>
            <edc:SFRFieldDef edc:cname="RXTYPE" edc:nzwidth="0x4" edc:desc="Receive Message Type"/>
            <edc:SFRFieldDef edc:cname="RXINT" edc:nzwidth="0x1" edc:desc="Receive Interrupt Occurred"/>
            <edc:SFRFieldDef edc:cname="RXEMPTY" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty"/>
            <edc:SFRFieldDef edc:cname="RXHEADER" edc:nzwidth="0x1" edc:desc="Receive Header"/>
            <edc:SFRFieldDef edc:cname="RXERROR" edc:nzwidth="0x1" edc:desc="Receive Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="TX_PROT" edc:nzwidth="0x20" edc:access="rrrrrrrrrrr---------------------" edc:impl="0xFFE00000" edc:_addr="0x50000048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="UNPROT" edc:nzwidth="0x1" edc:desc="Mailbox Message Unprotected"/>
            <edc:SFRFieldDef edc:cname="PRIV" edc:nzwidth="0x1" edc:desc="Mailbox message Privilaged"/>
            <edc:SFRFieldDef edc:cname="NSEC" edc:nzwidth="0x1" edc:desc="Mailbox Message Unsecured"/>
            <edc:SFRFieldDef edc:cname="USER" edc:nzwidth="0x8" edc:desc="User bits"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="RX_PROT" edc:nzwidth="0x20" edc:access="rrrrrrrrrrr---------------------" edc:impl="0xFFE00000" edc:_addr="0x5000004C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="UNPROTECT" edc:nzwidth="0x1" edc:desc="Mailbox Message Unprotected"/>
            <edc:SFRFieldDef edc:cname="PRIV" edc:nzwidth="0x1" edc:desc="Mailbox message Privilaged"/>
            <edc:SFRFieldDef edc:cname="NSEC" edc:nzwidth="0x1" edc:desc="Mailbox Message Unsecured"/>
            <edc:SFRFieldDef edc:cname="USER" edc:nzwidth="0x8" edc:desc="User bits"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="TX_HEADER" edc:nzwidth="0x20" edc:access="wwwwwwwwwww-wwwwwwwwwwwwwwwwwwww" edc:impl="0xFFEFFFFF" edc:_addr="0x50000050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="MSGSIZE" edc:nzwidth="0x10" edc:desc="Message Size"/>
            <edc:SFRFieldDef edc:cname="MSGINFO" edc:nzwidth="0x4" edc:desc="Message Info"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="UNPROT" edc:nzwidth="0x1" edc:desc="Unprotected Access"/>
            <edc:SFRFieldDef edc:cname="PRIV" edc:nzwidth="0x1" edc:desc="Privilaged Access"/>
            <edc:SFRFieldDef edc:cname="NSEC" edc:nzwidth="0x1" edc:desc="Non Secure Access"/>
            <edc:SFRFieldDef edc:cname="USER" edc:nzwidth="0x8" edc:desc="User Bits"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="RX_HEADER" edc:nzwidth="0x20" edc:access="----------r-rrrrrrrrrrrrrrrrrrrr" edc:impl="0x2FFFFF" edc:_addr="0x50000054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="MSGSIZE" edc:nzwidth="0x10" edc:desc="Message Size"/>
            <edc:SFRFieldDef edc:cname="MSGINFO" edc:nzwidth="0x4" edc:desc="Message Information"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="UNPROT" edc:nzwidth="0x1" edc:desc="Unprotected Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="CONFIG" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x50000058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="TX_INT_ENABLE" edc:nzwidth="0x1" edc:desc="Transmit Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RX_INT_ENABLE" edc:nzwidth="0x1" edc:desc="Receive Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20003A4" edc:_addr="0x5000005C"/>
      <edc:SFRDef ltx:memberofperipheral="INTCTRL" edc:cname="STATL" edc:nzwidth="0x20" edc:access="------------rrrrrr--r---rrr-rrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFC8EF" edc:_addr="0x52000400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="INTCTRL">
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="RTC Interrupt"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTDMA" edc:nzwidth="0x1" edc:desc="External DMA Interrupt"/>
            <edc:SFRFieldDef edc:cname="WDOG" edc:nzwidth="0x1" edc:desc="Watch Dog Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPER_BUSY" edc:nzwidth="0x1" edc:desc="Tamper Busy Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER0" edc:nzwidth="0x1" edc:desc="Timer 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER1" edc:nzwidth="0x1" edc:desc="Timer 1 interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWRDOWN" edc:nzwidth="0x1" edc:desc="Power Down Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MB_TX" edc:nzwidth="0x1" edc:desc="Mailbox TX Interrupt"/>
            <edc:SFRFieldDef edc:cname="MB_RX" edc:nzwidth="0x1" edc:desc="Mailbox RX Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRYPTO0" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="CRYPTO1" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="CRYPTO2" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="CRYPTO3" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x52000404"/>
      <edc:SFRDef ltx:memberofperipheral="INTCTRL" edc:cname="RSRL" edc:nzwidth="0x20" edc:access="------------nnnnnn--n---nnn-nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFC8EF" edc:_addr="0x52000408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="INTCTRL">
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="RTC Interrupt"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTDMA" edc:nzwidth="0x1" edc:desc="External DMA Interrupt"/>
            <edc:SFRFieldDef edc:cname="WDOG" edc:nzwidth="0x1" edc:desc="Watch Dog Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPER_BUSY" edc:nzwidth="0x1" edc:desc="Tamper Busy Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER0" edc:nzwidth="0x1" edc:desc="Timer 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER1" edc:nzwidth="0x1" edc:desc="Timer 1 interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWRDOWN" edc:nzwidth="0x1" edc:desc="Power Down Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MB_TX" edc:nzwidth="0x1" edc:desc="Mailbox TX Interrupt"/>
            <edc:SFRFieldDef edc:cname="MB_RX" edc:nzwidth="0x1" edc:desc="Mailbox RX Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRYPTO0" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="CRYPTO1" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="CRYPTO2" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="CRYPTO3" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x5200040C"/>
      <edc:SFRDef ltx:memberofperipheral="INTCTRL" edc:cname="ENAL" edc:nzwidth="0x20" edc:access="------------nnnnnn--n---nnn-nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFC8EF" edc:_addr="0x52000410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="INTCTRL">
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="RTC Interrupt"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTDMA" edc:nzwidth="0x1" edc:desc="External DMA Interrupt"/>
            <edc:SFRFieldDef edc:cname="WDOG" edc:nzwidth="0x1" edc:desc="Watch Dog Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPER_BUSY" edc:nzwidth="0x1" edc:desc="Tamper Busy Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER0" edc:nzwidth="0x1" edc:desc="Timer 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER1" edc:nzwidth="0x1" edc:desc="Timer 1 interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWRDOWN" edc:nzwidth="0x1" edc:desc="Power Down Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MB_TX" edc:nzwidth="0x1" edc:desc="Mailbox TX Interrupt"/>
            <edc:SFRFieldDef edc:cname="MB_RX" edc:nzwidth="0x1" edc:desc="Mailbox RX Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRYPTO0" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="CRYPTO1" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="CRYPTO2" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="CRYPTO3" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x52000414"/>
      <edc:SFRDef ltx:memberofperipheral="INTCTRL" edc:cname="CLRL" edc:nzwidth="0x20" edc:access="------------wwwwww--w---www-wwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFC8EF" edc:_addr="0x52000418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="INTCTRL">
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="RTC Interrupt"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTDMA" edc:nzwidth="0x1" edc:desc="External DMA Interrupt"/>
            <edc:SFRFieldDef edc:cname="WDOG" edc:nzwidth="0x1" edc:desc="Watch Dog Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPER_BUSY" edc:nzwidth="0x1" edc:desc="Tamper Busy Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER0" edc:nzwidth="0x1" edc:desc="Timer 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER1" edc:nzwidth="0x1" edc:desc="Timer 1 interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWRDOWN" edc:nzwidth="0x1" edc:desc="Power Down Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MB_TX" edc:nzwidth="0x1" edc:desc="Mailbox TX Interrupt"/>
            <edc:SFRFieldDef edc:cname="MB_RX" edc:nzwidth="0x1" edc:desc="Mailbox RX Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRYPTO0" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="CRYPTO1" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="CRYPTO2" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="CRYPTO3" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x5200041C"/>
      <edc:SFRDef ltx:memberofperipheral="INTCTRL" edc:cname="TSTL" edc:nzwidth="0x20" edc:access="------------nnnnnn--n---nnn-nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFC8EF" edc:_addr="0x52000420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="INTCTRL">
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="RTC Interrupt"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTDMA" edc:nzwidth="0x1" edc:desc="External DMA Interrupt"/>
            <edc:SFRFieldDef edc:cname="WDOG" edc:nzwidth="0x1" edc:desc="Watch Dog Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPER_BUSY" edc:nzwidth="0x1" edc:desc="Tamper Busy Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER0" edc:nzwidth="0x1" edc:desc="Timer 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER1" edc:nzwidth="0x1" edc:desc="Timer 1 interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWRDOWN" edc:nzwidth="0x1" edc:desc="Power Down Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MB_TX" edc:nzwidth="0x1" edc:desc="Mailbox TX Interrupt"/>
            <edc:SFRFieldDef edc:cname="MB_RX" edc:nzwidth="0x1" edc:desc="Mailbox RX Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRYPTO0" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="CRYPTO1" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="CRYPTO2" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="CRYPTO3" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x52000424"/>
      <edc:SFRDef ltx:memberofperipheral="INTCTRL" edc:cname="SELL" edc:nzwidth="0x20" edc:access="------------nnnnnn--n---nnn-nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFC8EF" edc:_addr="0x52000428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="INTCTRL">
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="RTC Interrupt"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTDMA" edc:nzwidth="0x1" edc:desc="External DMA Interrupt"/>
            <edc:SFRFieldDef edc:cname="WDOG" edc:nzwidth="0x1" edc:desc="Watch Dog Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPER_BUSY" edc:nzwidth="0x1" edc:desc="Tamper Busy Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER0" edc:nzwidth="0x1" edc:desc="Timer 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER1" edc:nzwidth="0x1" edc:desc="Timer 1 interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWRDOWN" edc:nzwidth="0x1" edc:desc="Power Down Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MB_TX" edc:nzwidth="0x1" edc:desc="Mailbox TX Interrupt"/>
            <edc:SFRFieldDef edc:cname="MB_RX" edc:nzwidth="0x1" edc:desc="Mailbox RX Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRYPTO0" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="CRYPTO1" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="CRYPTO2" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="CRYPTO3" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x5200042C"/>
      <edc:SFRDef ltx:memberofperipheral="INTCTRL" edc:cname="APRL" edc:nzwidth="0x20" edc:access="-------------nnnnn--n---nnn-nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7C8EF" edc:_addr="0x52000430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="INTCTRL">
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="RTC Interrupt"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTDMA" edc:nzwidth="0x1" edc:desc="External DMA Interrupt"/>
            <edc:SFRFieldDef edc:cname="WDOG" edc:nzwidth="0x1" edc:desc="Watch Dog Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPER_BUSY" edc:nzwidth="0x1" edc:desc="Tamper Busy Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER0" edc:nzwidth="0x1" edc:desc="Timer 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER1" edc:nzwidth="0x1" edc:desc="Timer 1 interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWRDOWN" edc:nzwidth="0x1" edc:desc="Power Down Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MB_TX" edc:nzwidth="0x1" edc:desc="Mailbox TX Interrupt"/>
            <edc:SFRFieldDef edc:cname="MB_RX" edc:nzwidth="0x1" edc:desc="Mailbox RX Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRYPTODMA" edc:nzwidth="0x1" edc:desc="Crypto DMA Interrupt"/>
            <edc:SFRFieldDef edc:cname="NDRNG" edc:nzwidth="0x1" edc:desc="RNG Interrupt"/>
            <edc:SFRFieldDef edc:cname="PKENGINE" edc:nzwidth="0x1" edc:desc="PK Engine Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x52000434"/>
      <edc:SFRDef ltx:memberofperipheral="INTCTRL" edc:cname="ATRL" edc:nzwidth="0x20" edc:access="------------nnnnnn--n---nnn-nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFC8EF" edc:_addr="0x52000438">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="INTCTRL">
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="RTC Interrupt"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTDMA" edc:nzwidth="0x1" edc:desc="External DMA Interrupt"/>
            <edc:SFRFieldDef edc:cname="WDOG" edc:nzwidth="0x1" edc:desc="Watch Dog Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPER_BUSY" edc:nzwidth="0x1" edc:desc="Tamper Busy Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER0" edc:nzwidth="0x1" edc:desc="Timer 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER1" edc:nzwidth="0x1" edc:desc="Timer 1 interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWRDOWN" edc:nzwidth="0x1" edc:desc="Power Down Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MB_TX" edc:nzwidth="0x1" edc:desc="Mailbox TX Interrupt"/>
            <edc:SFRFieldDef edc:cname="MB_RX" edc:nzwidth="0x1" edc:desc="Mailbox RX Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRYPTO0" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="CRYPTO1" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="CRYPTO2" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="CRYPTO3" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x5200043C"/>
      <edc:SFRDef ltx:memberofperipheral="INTCTRL" edc:cname="ITRL" edc:nzwidth="0x20" edc:access="------------nnnnnn--n---nnn-nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFC8EF" edc:_addr="0x52000440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="INTCTRL">
            <edc:SFRFieldDef edc:cname="RTC" edc:nzwidth="0x1" edc:desc="RTC Interrupt"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTDMA" edc:nzwidth="0x1" edc:desc="External DMA Interrupt"/>
            <edc:SFRFieldDef edc:cname="WDOG" edc:nzwidth="0x1" edc:desc="Watch Dog Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPER_BUSY" edc:nzwidth="0x1" edc:desc="Tamper Busy Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER0" edc:nzwidth="0x1" edc:desc="Timer 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="TIMER1" edc:nzwidth="0x1" edc:desc="Timer 1 interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWRDOWN" edc:nzwidth="0x1" edc:desc="Power Down Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MB_TX" edc:nzwidth="0x1" edc:desc="Mailbox TX Interrupt"/>
            <edc:SFRFieldDef edc:cname="MB_RX" edc:nzwidth="0x1" edc:desc="Mailbox RX Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRYPTO0" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="CRYPTO1" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="CRYPTO2" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="CRYPTO3" edc:nzwidth="0x1" edc:desc="Crypto Interrupt 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
