Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/edc/PIC32CK2051SG00064S1.PIC
      <edc:SFRDef ltx:memberofperipheral="EXTDMA" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----------nnn-nn" edc:impl="0xFFFF003B" edc:_addr="0x5200083C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXTDMA">
            <edc:SFRFieldDef edc:cname="FETCHER_BUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUSHER_BUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY_FLAG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FETCHER_NOT_EMPTY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUSHER_WAITING_FIFO" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="BYTES_NUMBER" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3C0" edc:_addr="0x52000840"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDCOUNT" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x52000C00"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDRELOAD" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52000C04"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDKICK" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x52000C08"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDCONTROL" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x52000C0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="WDRSTEN" edc:nzwidth="0x1" edc:desc="WDRSTEN"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x52000C10"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDSTOP" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x52000C14"/>
      <edc:AdjustPoint edc:offset="0xBE8" edc:_addr="0x52000C18"/>
      <edc:SFRDef ltx:memberofperipheral="TIMERS" edc:cname="RST" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52001800"/>
      <edc:SFRDef ltx:memberofperipheral="TIMERS" edc:cname="STOP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52001804"/>
      <edc:SFRDef ltx:memberofperipheral="TIMERS" edc:cname="INTEN" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52001808"/>
      <edc:SFRDef ltx:memberofperipheral="TIMERS" edc:cname="INTDIS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x5200180C"/>
      <edc:SFRDef ltx:memberofperipheral="TIMERS" edc:cname="STAT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52001810"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x52001814"/>
      <edc:SFRDef ltx:memberofperipheral="TIMERS" edc:cname="CNT0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52001818"/>
      <edc:SFRDef ltx:memberofperipheral="TIMERS" edc:cname="MATCH0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x5200181C"/>
      <edc:SFRDef ltx:memberofperipheral="TIMERS" edc:cname="CNT1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52001820"/>
      <edc:SFRDef ltx:memberofperipheral="TIMERS" edc:cname="MATCH1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x52001824"/>
      <edc:AdjustPoint edc:offset="0x3E4" edc:_addr="0x52001828"/>
      <edc:SFRDef ltx:memberofperipheral="SYSREGS" edc:cname="POWERCTRL" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:_addr="0x52001C0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSREGS">
            <edc:SFRFieldDef edc:cname="STATE" edc:nzwidth="0x3" edc:desc="Power Control State">
              <edc:SFRFieldSemantic edc:cname="ESECBOOTDONE" edc:desc="ESecure Boot is Finished" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="POWERDOWN" edc:desc="ESecure is in Power-down" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="HOSTBOOTDONE" edc:desc="Host Boot is Finished" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="ESecure is Idle" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="BUSY" edc:desc="ESecure is Busy" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:GPRDataSector edc:regionid="BATTREGS" edc:beginaddr="0x53800000" edc:endaddr="0x53800020" edc:isexecutable="true" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="APBB" edc:beginaddr="0x54000000" edc:endaddr="0x59000438" edc:rw="rw">
      <edc:AdjustPoint edc:offset="0x3000000" edc:_addr="0x54000000"/>
      <edc:SFRDef ltx:memberofperipheral="CSM" edc:cname="CSMCTRLA" edc:nzwidth="0x20" edc:access="----------------------------nn--" edc:por="00000000000000000000001100000000" edc:mclr="00000000000000000000001100000000" edc:impl="0xC" edc:_addr="0x57000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CSM">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SECURED" edc:nzwidth="0x1" edc:desc="Secured bit"/>
            <edc:SFRFieldDef edc:cname="RTCCLK" edc:nzwidth="0x1" edc:desc="RTC Clock Enable bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
