Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/edc/PIC32CK2051SG00064S1.PIC
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x5700030C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="SERREN" edc:nzwidth="0x1" edc:desc="Single Bit Error Interrupt Enable, Set"/>
            <edc:SFRFieldDef edc:cname="DERREN" edc:nzwidth="0x1" edc:desc="Double Bit Error Interrupt Enable, Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="INTSTA" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x57000310">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="SERR" edc:nzwidth="0x1" edc:desc="Single Bit Error"/>
            <edc:SFRFieldDef edc:cname="DERR" edc:nzwidth="0x1" edc:desc="Double Bit Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="FLTCTRL" edc:nzwidth="0x20" edc:access="------------------nn----------n-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3002" edc:_addr="0x57000314">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTEN" edc:nzwidth="0x1" edc:desc="Fault Injection Enabled">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="Disables fault injection." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Enables fault injection at FLTADR address offset as selected by FLTMD and FLTxPTR." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="FLTMD" edc:nzwidth="0x2" edc:desc="Fault Injection Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="FLTPTR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF00FF" edc:_addr="0x57000318">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="FLT1PTR" edc:nzwidth="0x8" edc:desc="Single Fault Injection Bit Pointer"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="FLT2PTR" edc:nzwidth="0x8" edc:desc="Double Fault Injection Bit Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="FLTADR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x5700031C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="FLTADR" edc:nzwidth="0x18" edc:desc="Fault Address Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="ERRCADR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x57000320">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="ERCADR" edc:nzwidth="0x18" edc:desc="ECC SECDED Error Capture Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="ERRCPAR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x57000324">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="ERCPAR" edc:nzwidth="0x8" edc:desc="ECC SECDED Error Capture Parity"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="ERRCSYN" edc:nzwidth="0x20" edc:access="----------------rr------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC0FF" edc:_addr="0x57000328">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="ERCSYN" edc:nzwidth="0x8" edc:desc="ECC SECDED Error Capture Syndrome">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="Not a Single bit error." edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Single bit error." edc:when="(field &amp; 0xFF) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ERR1" edc:nzwidth="0x1" edc:desc="ECC Single Bit Error"/>
            <edc:SFRFieldDef edc:cname="ERR2" edc:nzwidth="0x1" edc:desc="ECC Double Bit Error">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="Not a Double bit error." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Double bit error." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1FFFCD4" edc:_addr="0x5700032C"/>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="CNTL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnn-----------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFE0000" edc:_addr="0x59000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:AdjustPoint edc:offset="0x11"/>
            <edc:SFRFieldDef edc:cname="CNTL" edc:nzwidth="0xF" edc:desc="RTC Lower Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
